# 1. დაწერეთ პროგრამა, რომელიც მომხმარებელს შეეკითხება მართკუთხა სამკუთხედის კათეტების სიგრძეს(მთელი დადებითი რიცხვი)
# და გამოითვლის ამ სამკუთხედის ჰიპოთენუზის სიგრძეს და ფართობს.

a = int(input("შეიყვანეთ ერთი კათეტის სიგრძე: "))
b = int(input("შეიყვანეთ მეორე კათეტის სიგრძე: "))
c = int((a**2 + b**2)**0.5)
d = int(a * b / 2)

print("ჰიპოტენუზის სიგრძე: ", c, "სმ")
print("სამკუთხედის ფართობი: ", d, "სმ²")


# 2. დაწერეთ პროგრამა, რომელიც მომხმარებელს შეეკითხება წამების რაოდენობას და გამოიტანეთ საათების, წუთების და წამების
# რაოდენობა (მაგ. 20000 წამი არის  5 საათი, 33 წუთი, 20 წამი)

seconds = int(input("შეიყვანეთ წამების რაოდენობა: "))
hours = seconds // 3600
minutes = (seconds % 3600) // 60
remaining_seconds = seconds % 60

print("საათები: ", hours)
print("წუთები: ", minutes)
print("წამი: ", remaining_seconds)
